Repository: coteditor/CotEditor
Catalog: CotEditor/Localizables/AdvancedCharacterCount.xcstrings
Source language: en
Languages: cs, de, es, fr, it, ja, nl, pt, tr, zh_hans, zh_hant

source: *%lld* bytes
cs: *%lld* bajtů
de: *%lld* Byte
es: *%lld* octetos
fr: *%lld* octets
it: *%lld* byte
ja: *%lld*バイト
tr: *%lld* bayt
zh_hans: *%lld*字节
zh_hant: *%lld* byte

source: *%lld* characters
cs: *%lld* znaků
de: *%lld* Zeichen
es: *%lld* caracteres
fr: *%lld* caractères
it: *%lld* caratteri
ja: *%lld*文字
nl: *%lld* tekens
pt: *%lld* caracteres
tr: *%lld* karakter
zh_hans: *%lld*个字符
zh_hant: *%lld*個字元

source: Advanced Character Count…
cs: Pokročilé počítání znaků…
de: Erweiterte Zeichenanzahl …
es: Recuento avanzado de caracteres…
fr: Comptage de caractères avancé…
it: Conteggio caratteri avanzato…
ja: 高度な文字カウント…
nl: Geavanceerde tekentelling…
pt: Contagem avançada de caracteres…
tr: Gelişmiş Karakter Sayımı…
zh_hans: 高级字符计数…
zh_hant: 進階字元統計⋯

# CharacterUnit.byte.description
source: Count bytes of the text encoded with the specified encoding.
cs: Počítat bajty textu kódovaného zadaným kódováním.
de: Bytes des mit der angegebenen Codierung codierten Textes zahlen.
es: Contar los bytes del texto codificado con la codificación especificada.
fr: Compter les bytes de texte encodé selon l’encodage spécifié.
it: Conta i byte del testo codificato secondo la codifica specificata.
ja: 指定したエンコーディングでエンコードしたときのバイト長をカウントします。
nl: Telt bytes van de tekst gecodeerd met de opgegeven codering.
pt: Contar bytes do texto codificado com a codificação especificada.
tr: Belirtilen kodlama ile kodlanmış metnin baytlarını say.
zh_hans: 计算文本按照指定编码方式后得到的字节数。
zh_hant: 以文本自身的編碼、來統計該文本的位元組數量。

# CharacterUnit.byte.label
source: Byte
cs: Bajty
ja: バイト
tr: Bayt
zh_hans: 字节
zh_hant: 位元組

# CharacterUnit.graphemeCluster.description
source: Count in the intuitive way defined in Unicode. A character consisting of multiple Unicode code points, such as emojis, is counted as one character.
cs: Počítat intuitivním způsobem definovaným v Unicode. Znak složený z více kódových bodů Unicode, například emotikony, se počítá jako jeden znak.
de: Auf intuitive Weise, die in Unicode definiert ist, zahlen. Das aus mehreren Unicode-Codepunkten bestehende Zeichen, wie Emojis, wird als ein Zeichen gezählt.
es: Cuenta de la manera intuitiva definida en Unicode. Un carácter que consta de múltiples puntos de código Unicode, como emojis, se cuenta como un carácter.
fr: Comptage intuitif tel que défini par Unicode. Un caractère comprenant plusieurs points de code Unicode, par exemple un emoji, sont comptés comme un seul caractère.
it: Conta nel modo intuitivo definito in Unicode. Un carattere composto di più codici Unicode, come un emoji, è conteggiato come carattere unico.
ja: Unicodeで定義されている人の感覚に近い単位でカウントします。絵文字など複数のUnicodeコードポイントから成る文字も1文字で数えます。
nl: Tel op de intuïtieve manier zoals gedefinieerd in Unicode. Een teken dat uit meerdere Unicode-codepunten bestaat, zoals emoji's, wordt als één teken geteld.
pt: Conte da maneira intuitiva definida em Unicode. Um caractere que consiste em vários pontos de código Unicode, como emojis, é contado como um caractere.
tr: Unicode’da tanımlandığı üzere sezgisel olarak say. Birden çok Unicode kod noktasından oluşan bir karakter; örneğin Emojiler, bir karakter olarak sayılır.
zh_hans: 以 Unicode 中定义的直观方式进行计数。如颜文字这样由多个Unicode码点组成的字符，计数为一个字符。
zh_hant: 以萬國碼的直觀方式來統計文字數量。哪怕像是繪文字這樣的高萬字，也都按照單個文字來計算。

# CharacterUnit.graphemeCluster.label
source: Grapheme cluster
cs: Klastr grafémů
de: Graphemhaufen
es: Grupo de Grafemas
it: Raggruppamento di Grapheme
ja: 書記素クラスタ
nl: Grafeemcluster
pt: Agrupamentos de Grapheme
tr: Yazıbirim demeti
zh_hans: 字位簇
zh_hant: 書寫元素集

# CharacterUnit.unicodeScalar.description
source: Count Unicode code points. Same as counting UTF-32.
cs: Počítat kódové body Unicode. Stejné jako počítání UTF-32.
de: Unicode-Codepunkte zahlen. Das gleiche wie UTF-32 zu zählen.
es: Cuenta los puntos de código Unicode. Igual que contar UTF-32.
it: Conta i codici Unicode, come nella codifica UTF-32.
ja: Unicodeコードポイント単位でカウントします。UTF-32のカウントと同一です。
nl: Tel Unicode-codepunten. Hetzelfde als UTF-32 tellen.
pt: Contar pontos de código Unicode. O mesmo que contar UTF-32.
tr: Unicode kod noktalarını say. UTF-32 sayma ile aynıdır.
zh_hans: 计算Unicode码点，同UTF-32。
zh_hant: 統計萬國碼碼點數量（以 UTF-32 的方式）。

# CharacterUnit.unicodeScalar.label
source: Unicode scalar
cs: Skalár Unicode
de: Unicode-Skalar
es: Unicode escalar
fr: Scalaire Unicode
it: Scalare Unicode
ja: Unicodeスカラー
pt: Unicode escalar
tr: Unicode sayılı
zh_hans: Unicode标量
zh_hant: Unicode 純量

# CharacterUnit.utf16.description
source: Count Unicode code points but a surrogate pair as two characters.
cs: Počítat kódové body Unicode, ale náhradní dvojici jako dva znaky.
de: Unicode-Codepunkte aber Surrogate-Paaren als zwei Zeichen zahlen.
es: Cuenta los puntos de código Unicode, pero un par sustituto como dos caracteres.
fr: Compter les points de code Unicode, mais les paires de caractères de substitution comme deux caractères.
it: Conta i codici Unicode ma considera una coppia di caratteri sostitutivi come due caratteri.
ja: Unicodeコードポイント単位でカウントしますがサロゲートペアは2文字でカウントします。
nl: Tel Unicode-codepunten maar een surrogaatpaar als twee tekens.
pt: Conte os pontos de código Unicode, mas um par substituto como dois caracteres.
tr: Unicode kod noktalarını say; ancak vekil çifti iki karakter olarak say.
zh_hans: 计算Unicode Unicode码点，但将一个代理对计算为两个字符。
zh_hant: 統計萬國碼碼點數量，但將代理配對分別統計成兩個碼點。

source: Copy
cs: Kopírovat
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
nl: Kopieer
pt: Copiar
tr: Kopyala
zh_hans: 复制
zh_hant: 複製

source: Encoding:
cs: Kódování:
de: Codierung:
es: Codificación:
fr: Encodage :
it: Codifica:
ja: エンコーディング:
nl: Codering:
pt: Codificação:
tr: Kodlama:
zh_hans: 编码：
zh_hant: 編碼：

source: failed
cs: selhání
de: fehlgeschlagen
es: Falló
fr: échec
it: non riuscito
ja: 失敗
nl: mislukt
pt: falhou
tr: başarısız
zh_hans: 失败
zh_hant: 已失敗

source: Ignore line endings
cs: Ignorovat konce řádků
de: Zeilenumbrüche ignorieren
es: Ignorar los finales de línea
fr: Ignorer les fins de lignes
it: Ignora i fine riga
ja: 改行を無視
nl: Negeer regeleinden
pt: Ignorar finais de linha
tr: Satır sonlarını yok say
zh_hans: 忽略行尾
zh_hant: 忽略行尾

source: Ignore whitespace
cs: Ignorovat mezery
de: Leerzeichen ignorieren
es: Ignorar los espacios en blanco
fr: Ignorer les espaces
it: Ignora gli spazi bianchi
ja: 空白を無視
nl: Negeer wituimte
pt: Ignorar espaços em branco
tr: Boşlukları yok say
zh_hans: 忽略空格
zh_hant: 忽略空白字元

source: Normalization:
cs: Normalizace:
de: Normalisierung:
es: Normalización:
fr: Normalisation :
it: Normalizzazione:
ja: 正規化:
nl: Normalisatie:
pt: Normalização:
tr: Olağanlaştırma:
zh_hans: 标准化：
zh_hant: 標準化：

source: Show options
cs: Zobrazit volby
de: Optionen einblenden
es: Mostrar opciones
fr: Afficher les options
it: Mostra opzioni
ja: オプションを表示
nl: Toon opties
pt: Mostrar opções
tr: Seçenekleri göster
zh_hans: 显示选项
zh_hant: 顯示選項

source: Stop Advanced Character Count
cs: Zastavit pokročilé počítání znaků
de: Erweiterte Zeichenanzahl stoppen
es: Detener el recuento avanzado de caracteres
fr: Arrêter le comptage de caractères avancé
it: Interrompi il conteggio caratteri avanzato
ja: 高度な文字カウントを停止
nl: Stop geavanceerde tekentelling
pt: Parar Contagem Avançada de Caracteres
tr: Gelişmiş Karakter Sayımını Durdur
zh_hans: 停止高级字符计数
zh_hant: 停止進階字元統計

source: Stop Count
cs: Zastavit počítání
de: Anzahl stoppen
es: Parar cuenta
fr: Arrêter le comptage
it: Interrompi il conteggio
ja: カウントを停止
nl: Stop telling
pt: Parar Contagem
tr: Sayımı Durdur
zh_hans: 停止计数
zh_hant: 停止統計

source: Treat consecutive whitespace as one space
cs: Považovat po sobě jdoucí prázdné znaky za jednu mezeru
de: Aufeinander folgende Leerzeichen als ein Zeichen behandeln
es: Trata los espacios en blanco consecutivos como un solo espacio
fr: Compter les espaces consécutifs comme un seul
it: Tratta spazi bianchi consecutivi come un unico spazio
ja: 連続する空白を1文字として扱う
nl: Behandel opeenvolgende witruimtes als één ruimte
pt: Tratar espaços em branco consecutivos como um espaço
tr: Ardışık boşluklara tek boşluk olarak davran
zh_hans: 将连续空格视作一个空格
zh_hant: 將多個空白字元視為同一個

source: Unit:
cs: Jednotka:
de: Einheit:
es: Unidad:
fr: Unité :
it: Unità:
ja: 単位:
nl: Eenheid:
pt: Unidade:
tr: Birim:
zh_hans: 单位：
zh_hant: 單位：

source: Whitespace:
cs: Mezery:
de: Leerzeichen:
es: Espacio en blanco:
fr: Espaces :
it: Spazi bianchi:
ja: 空白:
nl: Witruimte:
pt: Espaços em branco:
tr: Boşluk:
zh_hans: 空格：
zh_hant: 空白字元：

source: Start
de: Starten
es: Iniciar
fr: Démarrer
it: Inizio
ja: 開始
nl: Begin
pt: Iniciar
tr: Başlangıç
zh_hans: 开始
zh_hant: 開始
